Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/iperf_demo/src/packs/WBZ653_DFP/component/dsu.h
/* -------- DSU_SECCFG : (DSU Offset: 0x48) ( R/ 32) Secure Config -------- */
#define DSU_SECCFG_RESETVALUE                 _UINT32_(0x00)                                       /*  (DSU_SECCFG) Secure Config  Reset Value */

#define DSU_SECCFG_SECCFG_Pos                 _UINT32_(0)                                          /* (DSU_SECCFG) Secure Config Position */
#define DSU_SECCFG_SECCFG_Msk                 (_UINT32_(0xFFFFFFFF) << DSU_SECCFG_SECCFG_Pos)      /* (DSU_SECCFG) Secure Config Mask */
#define DSU_SECCFG_SECCFG(value)              (DSU_SECCFG_SECCFG_Msk & (_UINT32_(value) << DSU_SECCFG_SECCFG_Pos)) /* Assigment of value for SECCFG in the DSU_SECCFG register */
#define DSU_SECCFG_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (DSU_SECCFG) Register Mask  */


/* -------- DSU_CTR_STAT : (DSU Offset: 0x4C) ( R/ 32) RoT Rollback counter -------- */
#define DSU_CTR_STAT_RESETVALUE               _UINT32_(0x00)                                       /*  (DSU_CTR_STAT) RoT Rollback counter  Reset Value */

#define DSU_CTR_STAT_ROLLBACK_CTR_Pos         _UINT32_(0)                                          /* (DSU_CTR_STAT) Rollback counter Position */
#define DSU_CTR_STAT_ROLLBACK_CTR_Msk         (_UINT32_(0xFF) << DSU_CTR_STAT_ROLLBACK_CTR_Pos)    /* (DSU_CTR_STAT) Rollback counter Mask */
#define DSU_CTR_STAT_ROLLBACK_CTR(value)      (DSU_CTR_STAT_ROLLBACK_CTR_Msk & (_UINT32_(value) << DSU_CTR_STAT_ROLLBACK_CTR_Pos)) /* Assigment of value for ROLLBACK_CTR in the DSU_CTR_STAT register */
#define DSU_CTR_STAT_Msk                      _UINT32_(0x000000FF)                                 /* (DSU_CTR_STAT) Register Mask  */


/* -------- DSU_BOOT_STAT : (DSU Offset: 0x50) ( R/ 32) RoT Boot Status -------- */
#define DSU_BOOT_STAT_RESETVALUE              _UINT32_(0x00)                                       /*  (DSU_BOOT_STAT) RoT Boot Status  Reset Value */

#define DSU_BOOT_STAT_BOOT_STATUS_Pos         _UINT32_(0)                                          /* (DSU_BOOT_STAT) Boot Status Position */
#define DSU_BOOT_STAT_BOOT_STATUS_Msk         (_UINT32_(0xFF) << DSU_BOOT_STAT_BOOT_STATUS_Pos)    /* (DSU_BOOT_STAT) Boot Status Mask */
#define DSU_BOOT_STAT_BOOT_STATUS(value)      (DSU_BOOT_STAT_BOOT_STATUS_Msk & (_UINT32_(value) << DSU_BOOT_STAT_BOOT_STATUS_Pos)) /* Assigment of value for BOOT_STATUS in the DSU_BOOT_STAT register */
#define DSU_BOOT_STAT_Msk                     _UINT32_(0x000000FF)                                 /* (DSU_BOOT_STAT) Register Mask  */


/* -------- DSU_BOOT_KEY : (DSU Offset: 0x54) ( R/ 32) Secure Boot Key n -------- */
#define DSU_BOOT_KEY_RESETVALUE               _UINT32_(0x00)                                       /*  (DSU_BOOT_KEY) Secure Boot Key n  Reset Value */

#define DSU_BOOT_KEY_BOOT_KEY_Pos             _UINT32_(0)                                          /* (DSU_BOOT_KEY) Secure Boot Key Position */
#define DSU_BOOT_KEY_BOOT_KEY_Msk             (_UINT32_(0xFFFFFFFF) << DSU_BOOT_KEY_BOOT_KEY_Pos)  /* (DSU_BOOT_KEY) Secure Boot Key Mask */
#define DSU_BOOT_KEY_BOOT_KEY(value)          (DSU_BOOT_KEY_BOOT_KEY_Msk & (_UINT32_(value) << DSU_BOOT_KEY_BOOT_KEY_Pos)) /* Assigment of value for BOOT_KEY in the DSU_BOOT_KEY register */
#define DSU_BOOT_KEY_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (DSU_BOOT_KEY) Register Mask  */


/* -------- DSU_ENTRY0 : (DSU Offset: 0x1000) ( R/ 32) CoreSight ROM Table Entry 0 -------- */
#define DSU_ENTRY0_RESETVALUE                 _UINT32_(0x9F0FC002)                                 /*  (DSU_ENTRY0) CoreSight ROM Table Entry 0  Reset Value */

#define DSU_ENTRY0_EPRES_Pos                  _UINT32_(0)                                          /* (DSU_ENTRY0) Entry Present Position */
#define DSU_ENTRY0_EPRES_Msk                  (_UINT32_(0x1) << DSU_ENTRY0_EPRES_Pos)              /* (DSU_ENTRY0) Entry Present Mask */
#define DSU_ENTRY0_EPRES(value)               (DSU_ENTRY0_EPRES_Msk & (_UINT32_(value) << DSU_ENTRY0_EPRES_Pos)) /* Assigment of value for EPRES in the DSU_ENTRY0 register */
#define DSU_ENTRY0_FMT_Pos                    _UINT32_(1)                                          /* (DSU_ENTRY0) Format Position */
#define DSU_ENTRY0_FMT_Msk                    (_UINT32_(0x1) << DSU_ENTRY0_FMT_Pos)                /* (DSU_ENTRY0) Format Mask */
#define DSU_ENTRY0_FMT(value)                 (DSU_ENTRY0_FMT_Msk & (_UINT32_(value) << DSU_ENTRY0_FMT_Pos)) /* Assigment of value for FMT in the DSU_ENTRY0 register */
#define DSU_ENTRY0_ADDOFF_Pos                 _UINT32_(12)                                         /* (DSU_ENTRY0) Address Offset Position */
#define DSU_ENTRY0_ADDOFF_Msk                 (_UINT32_(0xFFFFF) << DSU_ENTRY0_ADDOFF_Pos)         /* (DSU_ENTRY0) Address Offset Mask */
#define DSU_ENTRY0_ADDOFF(value)              (DSU_ENTRY0_ADDOFF_Msk & (_UINT32_(value) << DSU_ENTRY0_ADDOFF_Pos)) /* Assigment of value for ADDOFF in the DSU_ENTRY0 register */
#define DSU_ENTRY0_Msk                        _UINT32_(0xFFFFF003)                                 /* (DSU_ENTRY0) Register Mask  */


/* -------- DSU_ENTRY1 : (DSU Offset: 0x1004) ( R/ 32) CoreSight ROM Table Entry 1 -------- */
#define DSU_ENTRY1_RESETVALUE                 _UINT32_(0x00)                                       /*  (DSU_ENTRY1) CoreSight ROM Table Entry 1  Reset Value */

#define DSU_ENTRY1_Msk                        _UINT32_(0x00000000)                                 /* (DSU_ENTRY1) Register Mask  */


/* -------- DSU_END : (DSU Offset: 0x1008) ( R/ 32) CoreSight ROM Table End -------- */
#define DSU_END_RESETVALUE                    _UINT32_(0x00)                                       /*  (DSU_END) CoreSight ROM Table End  Reset Value */

#define DSU_END_END_Pos                       _UINT32_(0)                                          /* (DSU_END) End Marker Position */
#define DSU_END_END_Msk                       (_UINT32_(0xFFFFFFFF) << DSU_END_END_Pos)            /* (DSU_END) End Marker Mask */
#define DSU_END_END(value)                    (DSU_END_END_Msk & (_UINT32_(value) << DSU_END_END_Pos)) /* Assigment of value for END in the DSU_END register */
#define DSU_END_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (DSU_END) Register Mask  */


/* -------- DSU_MEMTYPE : (DSU Offset: 0x1FCC) ( R/ 32) CoreSight ROM Table Memory Type -------- */
#define DSU_MEMTYPE_RESETVALUE                _UINT32_(0x00)                                       /*  (DSU_MEMTYPE) CoreSight ROM Table Memory Type  Reset Value */

